rpc/test_data/autonomous_transfer_complete_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">123</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:AutonomousTransferComplete>
            <AnnounceURL>https://acme-networks.com/firmware/downloads</AnnounceURL>
            <TransferURL>https://acme-networks.com/firmware/downloads/firmware.bin</TransferURL>
            <IsDownload>true</IsDownload>
            <FileType>1 Firmware Upgrade Image</FileType>
            <FileSize>184258350</FileSize>
            <TargetFileName>firmware.bin</TargetFileName>
            <FaultStruct>0</FaultStruct>
            <StartTime>2024-06-10T23:04:00Z</StartTime>
            <CompleteTime>2024-06-10T23:05:00Z</CompleteTime>
        </cwmp:AutonomousTransferComplete>
    </soapenv:Body>
</soapenv:Envelope>
